app/views/condominios/show.html.erb

    <% if !current_user.is_admin? && !(can? :update, @condominio) %>
    <%= link_to 'Esci dal Condominio', condomino_path(Condomino.find_by(user_id: current_user.id, condominio_id: @condominio.id)), method: :delete, data: { confirm: 'Are you sure?' },:class => "btn btn-primary" %> | <% end %> <%= link_to 'Home', condominios_path,:class => "btn btn-primary" %>
---
SELECT "condominos".* FROM "condominos" WHERE "condominos"."user_id" = ? AND "condominos"."condominio_id" = ? LIMIT ?  [["user_id", 1], ["condominio_id", 2], ["LIMIT", 1]]

      <h2>Bacheca dei post:</h2>
        <% if @condominio.posts.exists? %>
---
SELECT 1 AS one FROM "posts" WHERE "posts"."condominio_id" = ? LIMIT ?  [["condominio_id", 2], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."condominio_id" = ?  [["condominio_id", 2]]

                <div class="post">
                  <% if User.find_by(id: post.user_id).avatar.present? %>
                    <%= image_tag(User.find_by(id: post.user_id).avatar.variant(resize_to_fill: [150, 150]), class: "rounded-circle") %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]