app/views/requests/index.html.erb

        <tr>
          <td><%= Condominio.find_by(id:request.condominio_id).nome %></td>
          <td><%= User.find_by(id:request.user_id).uname %></td>
---
SELECT "requests".* FROM "requests" WHERE (EXISTS(SELECT 1 from condominos where condominos.condominio_id = requests.condominio_id AND condominos.user_id = (1) AND condominos.is_condo_admin = true) )
SELECT "condominios".* FROM "condominios" WHERE "condominios"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "requests".* FROM "requests" WHERE "requests"."user_id" = ?  [["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

        <tr>
          <td><%= Condominio.find_by(id:request.condominio_id).nome %></td>
          <td><%= User.find_by(id:request.user_id).uname %></td>
---
SELECT "requests".* FROM "requests" WHERE (EXISTS(SELECT 1 from condominos where condominos.condominio_id = requests.condominio_id AND condominos.user_id = (1) AND condominos.is_condo_admin = true) )
SELECT "condominios".* FROM "condominios" WHERE "condominios"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]