app/views/requests/show.html.erb

SELECT "condominios".* FROM "condominios" WHERE "condominios"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    <strong>Condominio:</strong>
    <%= Condominio.find_by(id:@request.condominio_id).nome %>

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    <strong>User:</strong>
    <%= User.find_by(id:@request.user_id).uname %>