app/views/condominos/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
          <td>
            <% if User.find_by(id: condomino.user_id).avatar.present? %>

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
            <% end %></td>
          <td><%= User.find_by(id: condomino.user_id).uname %></td>

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
          <td>
            <% @User_avatar = User.find_by(id: condomino.user_id) %>

SELECT "condominios".* FROM "condominios" WHERE "condominios"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
          <td><%= link_to 'Informazioni', condomino %></td>
          <% if can? :destroy, Condominio.find_by(id: condomino.condominio_id) %>