app/views/enter/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "condominos" WHERE "condominos"."condominio_id" = ? AND "condominos"."user_id" = ? LIMIT ?  [["condominio_id", 1], ["user_id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "requests" WHERE "requests"."condominio_id" = ? AND "requests"."user_id" = ? LIMIT ?  [["condominio_id", 1], ["user_id", 1], ["LIMIT", 1]]
---
                                <%= f.hidden_field :condominio_id, value: condominio.id %>
                                <% if (Condomino.where(condominio_id: condominio.id,user_id: current_user.id).exists? || Request.where(condominio_id: condominio.id,user_id:current_user.id).exists?) %>