app/controllers/condominos_controller.rb

SELECT "condominios".* FROM "condominios" WHERE "condominios"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def index
    @condominio_attuale = Condominio.find_by(id: params[:condominio_id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    @condomino = Condomino.find(params[:id])
    @utente_id = @condomino.user_id
    if @utente_id != current_user.id
      authorize! :destroy, Condominio.find(@condomino.condominio_id)