app/controllers/condominos_controller.rb

SELECT "condominos".* FROM "condominos" WHERE "condominos"."condominio_id" = ? AND "condominos"."is_condo_admin" = ?  [["condominio_id", 2], ["is_condo_admin", 1]]
---
  def index
    @condomini = Condomino.where(condominio_id: params[:condominio_id], is_condo_admin: false)

SELECT "condominos".* FROM "condominos" WHERE "condominos"."condominio_id" = ? AND "condominos"."user_id" = ? LIMIT ?  [["condominio_id", 2], ["user_id", 2], ["LIMIT", 1]]
UPDATE "condominos" SET "is_condo_admin" = ?, "updated_at" = ? WHERE "condominos"."id" = ?  [["is_condo_admin", 1], ["updated_at", "2022-07-07 13:41:24.592962"], ["id", 2]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def eleva_condomino
    respond_to do |format|
      if Condomino.find_by(condominio_id: params[:condominio_id],user_id: params[:user_id]).update(is_condo_admin: true)
        format.html { redirect_to condominio_condominos_path(Condominio.find_by(id: params[:condominio_id])), notice: User.find_by(id: params[:user_id]).uname + ' è diventato un amministratore del condominio.' }

SELECT "condominos".* FROM "condominos" WHERE "condominos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "condominos" WHERE "condominos"."id" = ?  [["id", 2]]
---
  def destroy
    authorize! :destroy, Condomino
    @condomino = Condomino.find(params[:id])
    @condomino.destroy

SELECT "condominos".* FROM "condominos" WHERE "condominos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_condomino
      @condomino = Condomino.find(params[:id])