app/controllers/condominios_controller.rb

  def show
    cartella_condominio = GdriveCondoItem.find_by(condominio_id: @condominio.id)
    if cartella_condominio != nil
      if can? :update, @condominio
        @codice_cartella = "/" + cartella_condominio.folder_id
      else
        condomino_id = Condomino.find_by(user_id: current_user.id,condominio_id:@condominio.id).id
---
SELECT "condominos".* FROM "condominos" WHERE "condominos"."user_id" = ? AND "condominos"."condominio_id" = ? LIMIT ?  [["user_id", 1], ["condominio_id", 2], ["LIMIT", 1]]