app/controllers/condominios_controller.rb

SELECT "condominios".* FROM "condominios" WHERE (EXISTS(SELECT 1 from condominos where condominos.condominio_id = condominios.id AND condominos.user_id = (1) AND condominos.is_condo_admin = false) )
---
  def index
    @condominios = Condominio.all

INSERT INTO "condominios" ("nome", "comune", "indirizzo", "latitude", "longitude", "created_at", "updated_at", "flat_code") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "condominos" ("condominio_id", "user_id", "is_condo_admin", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["condominio_id", 3], ["user_id", 2], ["is_condo_admin", 1], ["created_at", "2022-07-07 09:17:14.143215"], ["updated_at", "2022-07-07 09:17:14.143215"]]
---
  def create
    @condominio = Condominio.new(condominio_params)
#    @condominio.condominos_attributes = [{ condominio_id: params[:id], user_id: current_user.id, is_condo_admin: true }]

    respond_to do |format|
      if @condominio.save!
      	@condomino = Condomino.new(condominio_id: @condominio.id, user_id: current_user.id, is_condo_admin: true)
      	@condomino.save

UPDATE "condominios" SET "indirizzo" = ?, "latitude" = ?, "longitude" = ?, "updated_at" = ?, "flat_code" = ? WHERE "condominios"."id" = ?  [["indirizzo", "Via tiburtina 210"], ["latitude", 41.9082188], ["longitude", 12.5270009], ["updated_at", "2022-07-07 09:26:27.256256"], ["flat_code", "tnc9d"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @condominio.update(condominio_params)

DELETE FROM "condominios" WHERE "condominios"."id" = ?  [["id", 2]]
DELETE FROM "condominos" WHERE "condominos"."id" = ?  [["id", 4]]
SELECT "condominos".* FROM "condominos" WHERE "condominos"."condominio_id" = ?  [["condominio_id", 2]]
---
  def destroy
    @condominio_id = @condominio.id
    @condominio.destroy

    respond_to do |format|
      Condomino.where(condominio_id: @condominio_id).destroy_all

SELECT "condominios".* FROM "condominios" WHERE "condominios"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_condominio
      @condominio = Condominio.find(params[:id])