app/controllers/enter_controller.rb

    def index
      latitude = request.location.latitude.presence || 	41.8973103
      longitude = request.location.longitude.presence || 12.5131378
      if (params[:città].present?)
        comune = params[:città]
        @condominios = Condominio.where('lower(comune) = ?', comune.downcase)
     else
      @condominios = Condominio.near([latitude,longitude], params[:distanza].present? ? params[:distanza] : 100, units: :km,:order => :distance)
---
SELECT condominios.*, (111.19492664455873 * ABS(condominios.latitude - 34.0) * 0.7071067811865475) + (96.29763124613503 * ABS(condominios.longitude - 45.0) * 0.7071067811865475) AS distance, CASE WHEN (condominios.latitude >= 34.0 AND condominios.longitude >= 45.0) THEN  45.0 WHEN (condominios.latitude <  34.0 AND condominios.longitude >= 45.0) THEN 135.0 WHEN (condominios.latitude <  34.0 AND condominios.longitude <  45.0) THEN 225.0 WHEN (condominios.latitude >= 34.0 AND condominios.longitude <  45.0) THEN 315.0 END AS bearing FROM "condominios" WHERE (condominios.latitude BETWEEN 33.10067839408127 AND 34.89932160591873 AND condominios.longitude BETWEEN 43.91522213746347 AND 46.08477786253653) ORDER BY "distance" ASC