app/controllers/enter_controller.rb

    def index
      latitude = request.location.latitude.presence || 	41.8973103
      longitude = request.location.longitude.presence || 12.5131378
      if (params[:città].present?)
        @condominios = Condominio.where(comune: params[:città])
---
SELECT "condominios".* FROM "condominios" WHERE "condominios"."comune" = ?  [["comune", "avezzano"]]

    def create
      @codice = params[:codice]
      respond_to do |format|
        if( !(Condominio.where(flat_code: @codice).exists?))
          format.html { redirect_to '/enter', notice: "Codice errato." }
          format.json {  render :show, status: :unprocessable_entity}
        elsif( Condomino.where(condominio_id: Condominio.find_by(flat_code: @codice).id, user_id: current_user.id).exists?)
          format.html { redirect_to '/enter', notice: "Già iscritto a questo condominio." }
          format.json {  render :show, status: :unprocessable_entity}
        else
          @condominio = Condominio.find_by(flat_code: @codice).id
          @enter = Condomino.new(condominio_id: @condominio, user_id: current_user.id, is_condo_admin: false)
          @enter.save
---
SELECT "condominios".* FROM "condominios" WHERE "condominios"."flat_code" = ? LIMIT ?  [["flat_code", "q1k89"], ["LIMIT", 1]]
SELECT 1 AS one FROM "condominios" WHERE "condominios"."flat_code" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT 1 AS one FROM "condominos" WHERE "condominos"."condominio_id" = ? AND "condominos"."user_id" = ? LIMIT ?  [["condominio_id", 1], ["user_id", 1], ["LIMIT", 1]]
INSERT INTO "condominos" ("condominio_id", "user_id", "is_condo_admin", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["condominio_id", 1], ["user_id", 1], ["is_condo_admin", 0], ["created_at", "2022-06-30 10:27:22.096676"], ["updated_at", "2022-06-30 10:27:22.096676"]]

      def set_condominio
        @condominio = Condominio.find(params[:id])
---
SELECT "condominios".* FROM "condominios" WHERE "condominios"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]