app/controllers/posts_controller.rb

SELECT "condominios".* FROM "condominios" WHERE "condominios"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "posts" ("title", "body", "condominio_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Ciao a tutti"], ["body", "eefefefe"], ["condominio_id", 1], ["user_id", 1], ["created_at", "2022-06-30 09:21:53.570405"], ["updated_at", "2022-06-30 09:21:53.570405"]]
---
  def create
    @condominio = Condominio.find(params[:condominio_id])
    @post       = @condominio.posts.create(post_params)

SELECT "condominios".* FROM "condominios" WHERE "condominios"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."condominio_id" = ? AND "posts"."id" = ? LIMIT ?  [["condominio_id", 2], ["id", 1], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]
---
  def destroy
    authorize! :destroy, Post
    @condominio = Condominio.find(params[:condominio_id])
    @post = @condominio.posts.find(params[:id])
    @post.destroy