app/controllers/requests_controller.rb

  def index
    @my_requests = Request.where(user_id: current_user.id)
    @recived_requests = Request.where("EXISTS(SELECT 1 from condominos where condominos.condominio_id = requests.condominio_id AND condominos.user_id = (?) AND condominos.is_condo_admin = true) ",current_user.id)
---
SELECT "requests".* FROM "requests" WHERE (EXISTS(SELECT 1 from condominos where condominos.condominio_id = requests.condominio_id AND condominos.user_id = (1) AND condominos.is_condo_admin = true) )
SELECT "condominios".* FROM "condominios" WHERE "condominios"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def edit
    @condomino=Condomino.new()
    @condomino.condominio_id = @request.condominio_id
    @condomino.user_id = @request.user_id
    @condomino.is_condo_admin = false
    if @condomino.save
      redirect_to condominio_url(@request.condominio_id), notice: "Richiesta accettata"
      @request.destroy
---
INSERT INTO "requests" ("condominio_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["condominio_id", 1], ["user_id", 1], ["created_at", "2022-06-26 13:14:39.518064"], ["updated_at", "2022-06-26 13:14:39.518064"]]
INSERT INTO "condominos" ("condominio_id", "user_id", "is_condo_admin", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["condominio_id", 2], ["user_id", 2], ["is_condo_admin", 0], ["created_at", "2022-07-07 09:18:48.401919"], ["updated_at", "2022-07-07 09:18:48.401919"]]
DELETE FROM "requests" WHERE "requests"."id" = ?  [["id", 1]]

  def create
    @request = Request.new(request_params)
    @request.user_id = current_user.id
    respond_to do |format|
      if @request.save
---
INSERT INTO "requests" ("condominio_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["condominio_id", 1], ["user_id", 1], ["created_at", "2022-07-07 08:32:10.936808"], ["updated_at", "2022-07-07 08:32:10.936808"]]

  def destroy
    @request.destroy
---
DELETE FROM "requests" WHERE "requests"."id" = ?  [["id", 2]]

    def set_request
      @request = Request.find(params[:id])
---
SELECT "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]