app/controllers/welcome_controller.rb

SELECT 1 AS one FROM "condominos" WHERE "condominos"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
  def check_signed_in
    if(current_user != nil && Condomino.where(user_id: current_user.id).exists?)