app/models/ability.rb

SELECT 1 AS one FROM "condominos" WHERE "condominos"."condominio_id" = ? AND "condominos"."is_condo_admin" = ? AND "condominos"."user_id" = ? LIMIT ?  [["condominio_id", 2], ["is_condo_admin", 1], ["user_id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "posts" WHERE (EXISTS(SELECT 1 from condominos where condominos.condominio_id = (2) AND condominos.user_id = (2) AND condominos.is_condo_admin = true) ) LIMIT ?  [["LIMIT", 1]]
SELECT 1 AS one FROM "requests" WHERE (EXISTS(SELECT 1 from condominos where condominos.condominio_id = (2) AND condominos.user_id = (1) AND condominos.is_condo_admin = true) ) LIMIT ?  [["LIMIT", 1]]
---
    def authenticated_abilities(user)
      can [:new,:create,:show,:update,:destroy], Condominio do |c|
        c.condominos.exists?(is_condo_admin: true, user_id: user.id)
      end
      can :Destroy, Post do |p|
        p.user_id == user.id or Post.where("EXISTS(SELECT 1 from condominos where condominos.condominio_id = (?) AND condominos.user_id = (?) AND condominos.is_condo_admin = true) ",p.condominio_id,user.id).exists?
      end
      can :edit, Request do |r|
        Request.where("EXISTS(SELECT 1 from condominos where condominos.condominio_id = (?) AND condominos.user_id = (?) AND condominos.is_condo_admin = true) ",r.condominio_id,user.id).exists?