app/models/user.rb

  def self.da_omniauth(acc_token)
  	data = acc_token.info
  	user = User.find_by(uname: data['name'],email: data['email'])
       return user if user
       user = User.create(uname: data['name'],
              email: data['email'],
              password: Devise.friendly_token[0,20],
              from_oauth: true
       )
---
SELECT "users".* FROM "users" WHERE "users"."uname" = ? AND "users"."email" = ? LIMIT ?  [["uname", "andrea panceri"], ["email", "panceri.1884749@studenti.uniroma1.it"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "uname", "from_oauth") VALUES (?, ?, ?, ?, ?, ?)