app/models/user.rb

  def self.da_omniauth(acc_token)
  	data = acc_token.info
  	user = User.where(email: data['email']).first
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "panceri.1884749@studenti.uniroma1.it"], ["LIMIT", 1]]